#include <iostream>;

int main()
{
	system("chcp 1251");
	system("cls");

	float a, b, c, p, s;
	printf("Напиши три стороны что бы узнать площадь: \n a=");
	scanf_s("%f", &a);
	printf(" b=");
	scanf_s("%f", &b);
	printf(" c=");
	scanf_s("%f", &c);
	system("cls");

	p = (a + b + c) / 2;
	s = sqrt(p * (p - a) * (p - b) * (p - c));
	printf("|-----------------------------------------------------------------| \n");
	
	printf("| Стороны треугольника:a= %f  | b= %f  | c= %f  | \n", a ,b,c);
	
	printf("|-----------------------------------------------------------------| \n");
	
	printf("| По формуле Герона,площадь получилась: %lf              | \n", s);
	
	
	printf("|-----------------------------------------------------------------|");

}
